//扱う全ての点(緯度、経度)
var allPoints = [
    [35.31223004131328, 139.78608432567634],
    [35.3067783372835, 139.79944566162183],
    [35.30656191525673, 139.8087962966409],
    [35.29815620234603, 139.83145559833656],
    [35.29591453143053, 139.83694876238394],
    [35.28806819427511, 139.8506816725025],
    [35.28582624396601, 139.85274160902028],
    [35.27083309914792, 139.8486217359848],
    [35.26240575058486, 139.85722309945285],
    [35.24835822188844, 139.86582446292093],
    [35.235010814820974, 139.87098528100174],
    [35.22236387661031, 139.87098528100174],
    [35.21603966829549, 139.8632440538805],
    [35.18441515903665, 139.81787226746366],
    [35.17395727651483, 139.81845384920612],
    [35.16587526397957, 139.82194333966106],
    [35.15684147586579, 139.81903543094865],
    [35.1501843584224, 139.8271775753434],
    [35.14828222482392, 139.8312486475408],
    [35.14067324582331, 139.83648288322314],
    [35.12735582099961, 139.8388092101931],
    [35.12069629179483, 139.83415655625322],
    [35.090828757995745, 139.84179068406038],
    [35.080153061182095, 139.84041739304854],
    [35.07790536802576, 139.8321776469774],
    [35.06610396308477, 139.82119131888254],
    [35.05654919491902, 139.82805777394185],
    [35.0388241071529, 139.82158480250376],
    [35.04316075332159, 139.81628808013912],
    [35.041353845391654, 139.81231553836562],
    [35.035210059515684, 139.81672947366948],
    [35.030150124298004, 139.8251159507469],
    [35.03123442250257, 139.82908849252036],
    [35.03159585204084, 139.8348266084154],
    [35.02472841751221, 139.84277169196238],
    [36.10206180893319, 139.78586942608248],
    [35.90349245545337, 140.02871232023824],
    [35.85168504300004, 140.23678551167248],
    [35.91844300113648, 140.46475181112984],
    [35.85502427727119, 140.6226802715973],
    [35.728034556518274, 140.86712606258163],
    [35.62986870570163, 140.56637534221323],
    [35.62986870570163, 140.56637534221323],
    [35.42869915590461, 140.3974605540611],
    [35.30278696644095, 140.41477549155738],
    [35.13290841219006, 140.26068548276695],
    [35.12003461005653, 140.1248211770149],
    [35.00747172026575, 139.98067246237557],
    [34.90494545719441, 139.8928577256134],
    [34.972857987867194, 139.7528512154177],
    [34.99118472726081, 139.85723476739793],
    [35.190476813338265, 139.82078336829372],
    [35.559970021210084, 140.101624829939],
    [35.67916906977136, 139.94836326645327],
];
var num = allPoints.length;

//点が集合する中心の緯度経度．グローバル変数
var real_cx = 140.26689879766658
var real_cy = 35.54143445827482;

//canvasへの参照．その高さ幅を獲得
var canvas = document.getElementById("myCanvas");
var ctx = canvas.getContext("2d");
var canvas_h = canvas.height;
var canvas_w = canvas.width;

//千葉の最北端と最南端の緯度差
var h = 36.1022 - 34.89;

//図示された千葉の高さが canvas の高さに占める割合
var rate = 0.8;

//点の半径を定義．乱数で点ごとに変化させる
var r = [];
for (var j = 0; j < num; j++){
    r[j] = 2 * (0.3 + Math.random());//2(px)に対し0.3から１.3までの乱数をかける
}

//すべての点を変換．これが集合後の位置となる． newArray はグローバル変数
var newArray = transform(allPoints);

//点の集合にかかる時間
var t_end =2;

//動きを再開する時間
var t_restart =4;

//始めの位置が最後の位置と比べ原点からの距離で何倍か
var k  = 10;

//位置を司るパラメータ
var s = (k - 1)/( t_end * t_end);


//時間間隔(ミリビョウ)
var interval = 80;

//時間幅を秒に直す
var dt = interval / 1000;

//時間発展の開始
var t = 0;
var timer = setInterval("draw()", interval);

function draw(){
    //白い長方形を重ねて以前の描画をクリアする
    ctx.fillStyle = "black";
    ctx.fillRect(0, 0, canvas_w, canvas_h);
    ctx.fillStyle = "yellow";

    //点の位置を更新
    var newPoints = timeChange(t);
    console.dir(newPoints);
    // 全ての点に丸を打つ
    for (var i = 0; i < num; i++){
        var temp = newPoints[i]; 
        ctx.beginPath();
        if(t > t_end && t < t_restart){
            //集合後には振動する
            ctx.arc(temp[0] + canvas_w / 2 + 2 * (Math.random()-0.5), temp[1] + canvas_h /2 + 2 * (Math.random()-0.5), r[i], 0, 2 * Math.PI);
        } else {
            //集合中．離散中は振動しない
            ctx.arc(temp[0] + canvas_w / 2, temp[1] + canvas_h /2, r[i], 0, 2 * Math.PI);
        }
        ctx.fill();
    }
    t = t + dt;
    //if(t >= t_end){
      //  clearInterval(timer);
    //}
}




//点(経度，緯度)からcanvasの左上端を原点とする座標(X, Y)[px]を返す関数
function transform(points){
   // var len = points.length;
    var array = [];
    for (var i = 0; i< num; i++){
    //yのみ反転させた相対緯度経度を求める
        var relative_x = points[i][1] - real_cx;
        var relative_y = real_cy - points[i][0];
        var X = rate * canvas_h * relative_x / h;
        var Y = rate * canvas_h * relative_y /h;
        //array.push([X + canvas_w / 2 ,Y + canvas_h /2 ]);
        array.push([X ,Y]);
    }
    return array;
}
//t秒後のすべての点の位置を求める関数
function timeChange(t){
    if (t <= t_end){
        var array = [];
     for (var i = 0; i < num; i++){
         var temp = newArray[i];
         var t_rate  = s * (t- t_end) * (t - t_end) + 1;
         array.push([temp[0] * t_rate, temp[1] * t_rate]);
        }
    return array;
    } else if(t > t_end && t < t_restart){
        //t がリスタートまではそのまま newArray を返し振動以外は静止させる
        return newArray;
    } else {
        //tがリスタート以降の処理
        array = [];
        for (i = 0; i < num; i++){
            temp = newArray[i];
            t_rate  = s * (t- t_restart) * (t - t_restart) + 1;
            array.push([temp[0] * t_rate, temp[1] * t_rate]);
           }
       return array;  
    }
}